docs/S16homepage/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-10 Mon 17:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sigma16 home page</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John T. O'Donnell" />
<link rel="stylesheet" type="text/css" href="docstyle.css" />
</head>
<body>
<div id="content">
<h1 class="title">Sigma16 home page</h1>
<p>
Sigma16 is a computer architecture designed for research and teaching
in computer systems.  This application provides a complete environment
for programming in assembly and machine language and experimenting
with the architecture.
</p>

<p>
The app runs in a web browser: just click the link in the box below.
You don't need to download or install anything.
</p>

<div class="quickstartbox">
<a href="https://sigma16.herokuapp.com/Sigma16/build/release/Sigma16/Sigma16.html">
  Click to run Sigma16 </a>
</div>

<p>
When the app runs in your browser, it will display the User Guide,
which contains introductory tutorials as well as a detailed
specification of the architecture, assembly language, and
programming techniques.
</p>

<p>
This architecture is simpler than most commercial products, making it
a good vehicle for teaching and experimentation:
</p>

<ul class="org-ul">
<li>It is a 16-bit architecture with a simple yet powerful instruction
set.</li>

<li>A small core subset of the architecture is suitable for introductory
teaching, and more advanced features support systems programming.</li>

<li>Software tools include an assembler, linker, emulator, and IDE.</li>

<li>Examples are provided that illustrate a variety of programming
techniques, data structures, compilation patterns, concurrency and
mutual exclusion, and more.</li>

<li>There is a digital circuit that implements Sigma16. The circuit is
specified at the level of logic gates and flip flops, and is
expressed in Hydra, a functional computer hardware description
language.  Sigma16 programs can be executed using the emulator,
and they can also be executed by simulating the digital circuit
using the Hydra tools.</li>
</ul>

<div id="outline-container-org0d21f4b" class="outline-2">
<h2 id="org0d21f4b">About Sigma16</h2>
<div class="outline-text-2" id="text-org0d21f4b">
<ul class="org-ul">
<li>This sofware is free and open source.</li>

<li>The version number is given in the running app on the Welcome
tab, the User Guide, and the Options tab.</li>

<li>The architecture, implementation, circuits, and examples are
designed and written by John O'Donnell.  See
<a href="https://jtod.github.io/index.html">https://jtod.github.io/index.html</a>.</li>

<li>Copyright &copy; 2022 John T. O'Donnell</li>

<li>License: GNU GPL Version 3 or later</li>

<li>The implementation is available on the
<a href="https://github.com/jtod/Sigma16/">source repository</a>.  The app
won't launch directly from the source repository; you need to
click the link above on this home page to run it.</li>

<li>Some components of the system, including the assembler and linker,
are available as command line tools as well as on the graphical
user interface provided by the web app.  The command line tools
require downloading and installation; see the User Guide for
details.</li>

<li>The full text of the license is given in the source repository in
Sigma16/LICENSE.txt, as well as at
<a href="https://www.gnu.org/licenses">https://www.gnu.org/licenses</a>.</li>
</ul>

<p>
Sigma16 is free software: you can redistribute it and/or modify it
under the terms of the GNU General Public License as published by the
Free Software Foundation, either version 3 of the License, or (at your
option) any later version.
</p>

<p>
Sigma16 is distributed in the hope that it will be useful, but WITHOUT
ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
for more details.
</p>

<p>
You should have received a copy of the GNU General Public License
along with Sigma16.  If not, see
<a href="https://www.gnu.org/licenses">https://www.gnu.org/licenses</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John T. O'Donnell</p>
<p class="date">Created: 2022-01-10 Mon 17:58</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
